Gabro1984/stm32-usb-can-converter/app/include/usbd_conf.h
/**
 ******************************************************************************
 * @file    USB_Device/CustomHID_Standalone/Inc/usbd_conf.h
 * @author  MCD Application Team
 * @brief   General low level driver configuration
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2015 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USBD_CONF_H
#define __USBD_CONF_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* #include "stm3210e_eval.h" */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Common Config */
#define USBD_MAX_NUM_INTERFACES       1
#define USBD_MAX_NUM_CONFIGURATION    1
#define USBD_MAX_STR_DESC_SIZ         0x100
#define USBD_SUPPORT_USER_STRING_DESC 0
#define USBD_SELF_POWERED             1
#define USBD_DEBUG_LEVEL              0

#define USBD_CUSTOMHID_OUTREPORT_BUF_SIZE 9
#define USBD_CUSTOM_HID_REPORT_DESC_SIZE  26

/* Exported macro ------------------------------------------------------------*/
/* Memory management macros */

/* For footprint reasons and since only one allocation is handled in the HID class
   driver, the malloc/free is changed into a static allocation method */

void* USBD_static_malloc(uint32_t size);
void  USBD_static_free(void* p);

/* TODO: adapt to size of report size, in production the size of data must be 9 byte
 instead 64 byte*/
#define MAX_STATIC_ALLOC_SIZE 21 /* Custom HID Class Driver Structure size */

#define USBD_malloc (uint32_t*)USBD_static_malloc
#define USBD_free   USBD_static_free
#define USBD_memset /* Not used */
#define USBD_memcpy /* Not used */

/* DEBUG macros */
#if (USBD_DEBUG_LEVEL > 0)
#    define USBD_UsrLog(...) \
        printf(__VA_ARGS__); \
        printf("\n");
#else
#    define USBD_UsrLog(...)
#endif

#if (USBD_DEBUG_LEVEL > 1)

#    define USBD_ErrLog(...) \
        printf("ERROR: ");   \
        printf(__VA_ARGS__); \
        printf("\n");
#else
#    define USBD_ErrLog(...)
#endif

#if (USBD_DEBUG_LEVEL > 2)
#    define USBD_DbgLog(...) \
        printf("DEBUG : ");  \
        printf(__VA_ARGS__); \
        printf("\n");
#else
#    define USBD_DbgLog(...)
#endif

/* Exported functions ------------------------------------------------------- */

#endif /* __USBD_CONF_H */
